{
  "_name_or_path": "distilbert-base-german-cased",
  "activation": "gelu",
  "activation_function": null,
  "activation_position": "before",
  "architectures": [
    "DistilBertForCustomClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "initializer_range": 0.02,
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.1,
  "sinusoidal_pos_embds": true,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.42.3",
  "vocab_size": 31102,
  "without_activation_function": true
}
